Preguntas nuevas:

- ¿Cual es el ratio de hombres y mujeres segun el perfil?
- ¿Cual es perfil educativo para cada puesto?
- Herramientas mas utilizadas segun los perfiles. 
- ¿Cuál es la diferencia de salarios entre hombres y mujeres segun el perfil?
- Perfil segun pais que herramientas usan, en coparativa con España.


Extras:
- ¿Cómo se distribuye este porcentaje segun los paises?

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns 
import numpy as np

In [2]:
df = pd.read_pickle("data/data_limpieza.pickle")

In [3]:
df.head(2)

,level_0,index,time,age,gender,pais,formacion,puesto,experiencia_prog,lenguaje_top,...,uso_ml,salario,inversion_ml,ppal_herramienta_data,lenguaje_prog,plataforma,plat_cursos,nubes,plataforma_top,salario_max
0,0,0,910,50-54,Man,India,Bachelor’s degree,Other,5-10 years,Python,...,No (we do not use ML methods),25000-29999,$100-$999,"Local development environments (RStudio, Jupyt...","Python, R",Vim / Emacs,"edX,Kaggle Learn Courses,DataCamp,Udacity,Udemy","GitHub , Kaggle",NaN,29999
1,1,1,784,50-54,Man,Indonesia,Master’s degree,Program/Project Manager,20+ years,Python,...,We are exploring ML methods (and may one day p...,60000-69999,$0 ($USD),"Advanced statistical software (SPSS, SAS, etc.)","SQL, C, C++, Java","Notepad++,Jupyter Notebook","Kaggle Learn Courses,Cloud-certification progr...",NaN,NaN,69999

In [4]:
df.sample(5)

,level_0,index,time,age,gender,pais,formacion,puesto,experiencia_prog,lenguaje_top,...,uso_ml,salario,inversion_ml,ppal_herramienta_data,lenguaje_prog,plataforma,plat_cursos,nubes,plataforma_top,salario_max
396,396,396,856,50-54,Man,Spain,Bachelor’s degree,Data Analyst,1-3 years,R,...,We are exploring ML methods (and may one day p...,60000-69999,"$1000-$9,999","Local development environments (RStudio, Jupyt...",R,RStudio,edX,GitHub,NaN,69999
3697,3697,3697,1088,50-54,Man,United States of America,Bachelor’s degree,Software Engineer,20+ years,Python,...,We are exploring ML methods (and may one day p...,125000-149999,$100-$999,"Basic statistical software (Microsoft Excel, G...","Python, SQL, Java, Javascript, Bash, Other","Jupyter (JupyterLab, Jupyter Notebooks, etc) ,...","LinkedIn Learning,Other",I do not share my work publicly,NaN,149999
2213,2213,2213,551,30-34,Man,United States of America,Master’s degree,Data Scientist,10-20 years,SQL,...,"We have well established ML methods (i.e., mod...",200000-249999,$0 ($USD),NaN,"Python, R, SQL, Bash","Jupyter (JupyterLab, Jupyter Notebooks, etc) ,...",NaN,NaN,NaN,249999
2434,2434,2434,134,25-29,Woman,India,Master’s degree,Business Analyst,5-10 years,Python,...,NaN,NaN,NaN,NaN,"Python, R, SQL",Jupyter Notebook,NaN,NaN,NaN,NaN
2276,2276,2276,504,22-24,Man,Ireland,Master’s degree,Student,1-3 years,Python,...,NaN,NaN,NaN,"Local development environments (RStudio, Jupyt...","Python, R, SQL, Javascript","Jupyter (JupyterLab, Jupyter Notebooks, etc) ,...","Kaggle Learn Courses,University Courses (resul...",NaN,NaN,NaN

In [5]:
df[df["salario"] == "1000000"].count()

level_0                  0
index                    0
time                     0
age                      0
gender                   0
pais                     0
formacion                0
puesto                   0
experiencia_prog         0
lenguaje_top             0
exp_ml                   0
tamaño_empresa           0
uso_ml                   0
salario                  0
inversion_ml             0
ppal_herramienta_data    0
lenguaje_prog            0
plataforma               0
plat_cursos              0
nubes                    0
plataforma_top           0
salario_max              0
dtype: int64

In [6]:
df["salario_max"].isnull().sum()

10582

In [7]:
df["salario"].isnull().sum()

10582

In [8]:
df.dtypes

level_0                   int64
index                     int64
time                      int64
age                      object
gender                   object
pais                     object
formacion                object
puesto                   object
experiencia_prog         object
lenguaje_top             object
exp_ml                   object
tamaño_empresa           object
uso_ml                   object
salario                  object
inversion_ml             object
ppal_herramienta_data    object
lenguaje_prog            object
plataforma               object
plat_cursos              object
nubes                    object
plataforma_top           object
salario_max              object
dtype: object

In [9]:
pd.to_numeric(df["salario_max"], errors = "coerce")

0        29999.0
1        69999.0
2          999.0
3        39999.0
4        39999.0
          ...
25968    19999.0
25969        NaN
25970      999.0
25971        NaN
25972      999.0
Name: salario_max, Length: 25973, dtype: float64

In [10]:
df.dtypes

level_0                   int64
index                     int64
time                      int64
age                      object
gender                   object
pais                     object
formacion                object
puesto                   object
experiencia_prog         object
lenguaje_top             object
exp_ml                   object
tamaño_empresa           object
uso_ml                   object
salario                  object
inversion_ml             object
ppal_herramienta_data    object
lenguaje_prog            object
plataforma               object
plat_cursos              object
nubes                    object
plataforma_top           object
salario_max              object
dtype: object

In [11]:
def salario_max(col):
    try:
        return int(col)

    except:
        return np.nan

In [12]:
df["salario_max"] = df["salario_max"].apply(salario_max)

In [13]:
df.dtypes

level_0                    int64
index                      int64
time                       int64
age                       object
gender                    object
pais                      object
formacion                 object
puesto                    object
experiencia_prog          object
lenguaje_top              object
exp_ml                    object
tamaño_empresa            object
uso_ml                    object
salario                   object
inversion_ml              object
ppal_herramienta_data     object
lenguaje_prog             object
plataforma                object
plat_cursos               object
nubes                     object
plataforma_top            object
salario_max              float64
dtype: object

In [14]:
df["salario_max"].isnull().sum()

10582

In [50]:
df.head(2)

,level_0,index,time,age,gender,pais,formacion,puesto,experiencia_prog,lenguaje_top,exp_ml,tamaño_empresa,uso_ml,salario,inversion_ml,ppal_herramienta_data,lenguaje_prog,plataforma,plat_cursos,nubes,plataforma_top,salario_max
0,0,0,910,50-54,Man,India,Bachelor’s degree,Other,5-10 years,Python,5-10 years,50-249 employees,No (we do not use ML methods),25000-29999,$100-$999,"Local development environments (RStudio, Jupyt...","Python, R",Vim / Emacs,"edX,Kaggle Learn Courses,DataCamp,Udacity,Udemy","GitHub , Kaggle",NaN,29999.0
1,1,1,784,50-54,Man,Indonesia,Master’s degree,Program/Project Manager,20+ years,Python,< 1 year,"1000-9,999 employees",We are exploring ML methods (and may one day p...,60000-69999,$0 ($USD),"Advanced statistical software (SPSS, SAS, etc.)","SQL, C, C++, Java","Notepad++,Jupyter Notebook","Kaggle Learn Courses,Cloud-certification progr...",NaN,NaN,69999.0

In [16]:
df["salario_max"].isnull().value_counts()

False    15391
True     10582
Name: salario_max, dtype: int64

In [17]:
df_estudiantes = df[df["puesto"] == "Student"]

In [18]:
df_estudiantes.shape

(6804, 22)

In [19]:
df_estudiantes["salario_max"].isnull().sum()

6804

In [20]:
df_other = df[df["puesto"] == "Other"]

In [21]:
df_other.shape

(2393, 22)

In [22]:
df_other["salario_max"].isnull().sum()

189

In [23]:
df_desem = df[df["puesto"] == "Currently not employed"]

In [24]:
df_desem.shape

(1986, 22)

In [25]:
df_desem["salario_max"].isnull().sum()

1986

In [29]:
df["salario_max"].value_counts()

999.0        3369
1999.0        969
14999.0       950
39999.0       741
124999.0      725
7499.0        699
59999.0       697
49999.0       688
24999.0       587
2999.0        575
19999.0       573
9999.0        552
69999.0       551
29999.0       470
79999.0       464
4999.0        456
199999.0      392
89999.0       391
3999.0        380
149999.0      379
99999.0       350
249999.0      177
499999.0       91
299999.0       75
1000000.0      58
999999.0       32
Name: salario_max, dtype: int64

In [55]:
df_salarios_pais= pd.DataFrame(df.groupby(['pais','gender', 'puesto'])['salario_max'].mean().round(2))

In [56]:
pd.set_option('display.max_rows', None)

In [ ]:
df_salarios_pais.sort_values('salario_max', ascending= True)

#### Filtrar paises para quedarnos solo con Europa a la hora de analizar los sueldos, para luego poder categorizarlos con el .cut() y comparar la diferencia entre generos y/o por puestos.

categorizar los salarios (confiamos en el .cut())
el cosito del KNN para los nulos!!!

In [ ]:
$ pip install a-world-of-countries  # Instalador de libreria para poder clasificar los  paises por continentes

In [59]:
# Import the AWOC package.
import awoc

# Initialize the AWOC class.
my_world = awoc.AWOC()

In [60]:
europa= my_world.get_countries_list_of('Europe')

In [61]:
europa

['Albania',
 'Andorra',
 'Austria',
 'Belarus',
 'Belgium',
 'Bosnia and Herzegovina',
 'Bulgaria',
 'Croatia',
 'Cyprus',
 'Czech Republic',
 'Denmark',
 'Estonia',
 'Faroe Islands',
 'Finland',
 'France',
 'Germany',
 'Gibraltar',
 'Greece',
 'Guernsey',
 'Hungary',
 'Iceland',
 'Ireland',
 'Isle of Man',
 'Italy',
 'Jersey',
 'Kosovo',
 'Latvia',
 'Liechtenstein',
 'Lithuania',
 'Luxembourg',
 'Macedonia',
 'Malta',
 'Moldova',
 'Monaco',
 'Montenegro',
 'Netherlands',
 'Norway',
 'Poland',
 'Portugal',
 'Romania',
 'Russia',
 'San Marino',
 'Serbia',
 'Slovakia',
 'Slovenia',
 'Spain',
 'Svalbard and Jan Mayen',
 'Sweden',
 'Switzerland',
 'Ukraine',
 'United Kingdom',
 'Vatican']

In [68]:
for x in df['pais']:
   for i in europa: 
        if x in (europa):
            df['europa']= 'SI'
        else:
            df['europa']= 'NO'

KeyboardInterrupt:

#### Ver si podemos hacer la iteracion con un apply u otro metodo.

In [66]:
df['europa'].unique()

array(['NO'], dtype=object)